000100 identification division.
000200 program-id. PAYRDFFL.
000300* Reads payroll file PAY0317I TO CALCULATE GROSS AND NET.
000400* Determines price of rug.
000500* Write out new file with results.
000600* Creates a report of the input. 
000700
000800 environment division.
000900 configuration section.
001000 INPUT-OUTPUT SECTION.
001100 FILE-CONTROL.
001200 select PAYROLL-FILE-IN
001300*  assign to "C:\Users\call1\PAY0317I.DAT"
001400   assign to "C:\Users\Ryan\Downloads\PAY0317I.DAT"
001500   organization is line sequential
001600   file status is WS-PAYROLL-FILE-IN-STATUS.
001700   
001800 SELECT PAYROLL-FILE-OUT
001900*  ASSIGN To "C:\Users\call1\PAY0317O.dat"
002000   ASSIGN TO "C:\Users\Ryan\Downloads\PAY0317O.TXT"
002100   organization is line sequential
002200   file status is WS-PAYROLL-FILE-OUT-STATUS.
002300   
002400 SELECT PAYROLL-ERROR-FILE-OUT
002500*    ASSIGN TO "C:\Users\call1\PAYERROR.TXT"
002600     ASSIGN TO "C:\Users\Ryan\Downloads\PAYERROR.TXT"
002700     ORGANIZATION IS LINE SEQUENTIAL
002800     FILE STATUS IS WS-PAYROLL-ERROR-FILE-OUT-STATUS.
002900
003000 DATA DIVISION.
003100 FILE SECTION.
003200 FD  PAYROLL-FILE-IN                                    
003300     RECORDING MODE IS F  
003400     DATA RECORD IS PAYROLL-REC-IN.                  
003500 01  PAYROLL-REC-IN.
003600     05 PAYROLL-DATE           PIC X(06).
003700     05 EMP-NO                 PIC X(03).
003800     05 EMP-HOURS              PIC 9(02)V99.
003900     05 EMP-HOURS-X            REDEFINES
004000        EMP-HOURS              PIC X(04).
004100     05 EMP-PAY-RATE           PIC 9(02)V99.
004200     05 EMP-PAY-RATE-X         REDEFINES
004300        EMP-PAY-RATE           PIC X(04).
004400 
004500 FD  PAYROLL-FILE-OUT                                   
004600     RECORDING MODE IS F  
004700     DATA RECORD IS PAYROLL-REC-OUT.                  
004800 01  PAYROLL-REC-OUT.
004900     05 PAYROLL-FROM-INPUT     PIC X(17).
005000     05 PAYROLL-CALC-OUT       PIC X(33).
005100 01  PAYROLL-TOTALS-RECORD     REDEFINES 
005200     PAYROLL-REC-OUT.
005300     05 FILLER                 PIC X(15).
005400     05 FILLER-CODE            PIC X(01).
005500     05 RUN-DATE               PIC XX/XX/XX.
005600     05 TOTAL-GROSS            PIC 9(06).
005700     05 TOTAL-NET              PIC 9(06).
005800     05 FILLER                 PIC X(16).
005900     
006000 FD PAYROLL-ERROR-FILE-OUT
006100    RECORDING MODE IS F
006200    DATA RECORD IS PAYROLL-ERROR-OUT.
006300 01 PAYROLL-ERROR-OUT.
006400    05 ERROR-PAYROLL-FROM-INPUT      PIC X(17).
006500    05 ERROR-PAYROLL-CALC-OUT        PIC X(33).
006600
006700 working-storage section.
006800
006900 01  WS-CALCULATION-FIELDS.
007000     05 WS-RECORD-COUNT-IN      PIC 9(02)    VALUE 0.
007100     05 WS-RECORD-COUNT-OUT     PIC 9(02)    VALUE 0.
007200     05 WS-TOTAL-FILE-COST      PIC 9(08)V99 VALUE 0.
007300     05 WS-TOTAL-FILE-AREA      PIC 9(08)V99 VALUE 0.
007400     05 WS-TOTAL-FILE-PERIMETER PIC 9(06)V99 VALUE 0.
007500     05 WS-PAGE-COUNT           PIC 999      VALUE 0.
007600     05 WS-LINE-COUNT           PIC 99       VALUE 0.
007700     05 WS-TAX-RATE             PIC V9999    VALUE .1000.
007800     05 WS-MEDICARE-SS          PIC V9999    VALUE .0765.
007900     05 WS-HEALTHCARE           PIC 9(03)V99 VALUE 073.25.
008000 
008100 01  WS-EMP-OUTPUT-AREA.   
008200     05 EMP-GROSS              PIC 9(04)V99.
008300     05 EMP-MEDICARE-SS        PIC 9(03)V99.
008400     05 EMP-HEALTHCARE         PIC 9(03)V99.
008500     05 EMP-TAX                PIC 9(03)V99.
008600     05 EMP-DEDUCTIONS         PIC 9(04)V99.
008700     05 EMP-NET                PIC 9(04)V99.
008800 01 WS-OUTPUT-ASTERISKS-1      PIC X(33) VALUE
008900                 "*********************************".
009000 01 WS-OUTPUT-ASTERISKS-2      PIC X(17) VALUE
009100                 "*****************".
009200 01 WS-ERROR-RECORD-COUNT      PIC 99    VALUE 0.
009300 
009400 01 WS-TRAILER-FIELDS.
009500     05 WS-FILLER-RECORD       PIC X(01).
009600         88 TRAILER-RECORD         VALUE 'T'.
009700     05 WS-TOTAL-GROSS         PIC 9(06) VALUE 0.
009800     05 WS-TOTAL-NET           PIC 9(06) VALUE 0.
009900 
010000 01  WS-PAYROLL-FILE-IN-STATUS   pic X(02).
010100     88 PAYROLL-FILE-IN-SUCCESSFUL         VALUE "00".
010200     88 END-OF-PAYROLL-FILE                VALUE "10".
010300     88 INVALID-PAYROLL-IN-FILE            VALUE "11" THRU "99".
010400     88 PAYROLL-FILE-NOT-READY             VALUE "01" THRU "99".
010500     
010600 01  WS-PAYROLL-FILE-OUT-STATUS  pic X(02).
010700     88 GOOD-PAYROLL-FILE-WRITE            VALUE "00".
010800     
010900 01  WS-PAYROLL-ERROR-FILE-OUT-STATUS   pic X(02).
011000     88 GOOD-PAYROLL-ERROR-FILE-WRITE      VALUE "00".
011100     
011200 01 ANY-KEY                      pic X(01).
011300
011400 01 WS-RUN-DATE                PIC X(08).
011500 01 WS-RULER                   PIC X(50)
011600    VALUE "----+----1----+----2----+----3----+----4----+----5".
011700     
011800 procedure division.
011900
012000     DISPLAY "START PAYROLLRPT".
012100     
012200     PERFORM XXXX-INITIALIZE.
012300     PERFORM XXXX-READ-PAYROLL.
012400     
012500     perform until END-OF-PAYROLL-FILE
012600       perform XXXX-REDEFINE-NUMERIC
012700*      perform XXXX-CALCULATE-FIELDS
012800       perform XXXX-WRITE-PAYROLLS-RECORD
012900*       perform XXXX-CREATE-DETAIL-LINE
013000       perform XXXX-READ-PAYROLL
013100     END-PERFORM.
013200     
013300*    PERFORM XXXX-WRITE-TRAILER.
013400     
013500     write PAYROLL-REC-OUT from WS-RULER.
013600*      perform XXXX-CREATE-REPORT-TOTAL-LINE.
013700*     move WS-TOTAL-FILE-COST to WS-COST-OUT.
013800     
013900*     display " FILE COST      : " WS-COST-OUT.
014000     display " RECORDS READ   : " WS-RECORD-COUNT-IN.
014100     display " RECORDS WRITTEN: " WS-RECORD-COUNT-OUT.
014200     DISPLAY " ERRORS         : " WS-ERROR-RECORD-COUNT.
014300     display "END OF PAYROLLRPT".
014400     
014500     
014600     
014700     close PAYROLL-FILE-IN
014800           PAYROLL-FILE-OUT
014900           PAYROLL-ERROR-FILE-OUT.
015000     
015100     display "Press any key to exit.".
015200         accept ANY-KEY.
015300   
015400  goback.
015500 
015600 XXXX-REDEFINE-NUMERIC.
015700     if EMP-HOURS-X is numeric and EMP-PAY-RATE-X is numeric
015800             perform XXXX-CALCULATE-FIELDS
015900     ELSE
016000       display PAYROLL-DATE  " "  EMP-NO
016100       MOVE WS-HEALTHCARE        TO EMP-HEALTHCARE
016200       MOVE PAYROLL-REC-IN       TO ERROR-PAYROLL-FROM-INPUT
016300       MOVE WS-EMP-OUTPUT-AREA   TO ERROR-PAYROLL-CALC-OUT
016400*      move WS-OUTPUT-ASTERISKS-1 to PAYROLL-CALC-OUT
016500*      MOVE WS-OUTPUT-ASTERISKS-2 to PAYROLL-FROM-INPUT
016600       PERFORM XXXX-WRITE-PAYROLL-ERROR-RECORD
016700       ADD 1 TO WS-ERROR-RECORD-COUNT
016800     END-IF.
016900     
017000     
017100 XXXX-CALCULATE-FIELDS.
017200
017300     COMPUTE EMP-GROSS = EMP-PAY-RATE * EMP-HOURS
017400     COMPUTE EMP-MEDICARE-SS = EMP-GROSS * WS-MEDICARE-SS.
017500     COMPUTE EMP-NET = EMP-GROSS - EMP-MEDICARE-SS 
017600                     - WS-HEALTHCARE.
017700     COMPUTE EMP-TAX = EMP-NET * WS-TAX-RATE.
017800     COMPUTE EMP-NET = EMP-NET - EMP-TAX.
017900     COMPUTE EMP-DEDUCTIONS = EMP-GROSS - EMP-NET.
018000     
018100     COMPUTE WS-TOTAL-GROSS = WS-TOTAL-GROSS + EMP-GROSS.
018200     COMPUTE WS-TOTAL-NET = WS-TOTAL-NET + EMP-NET.
018300     
018400     MOVE WS-HEALTHCARE        TO EMP-HEALTHCARE.
018500     MOVE PAYROLL-REC-IN       TO PAYROLL-FROM-INPUT.
018600     MOVE WS-EMP-OUTPUT-AREA   TO PAYROLL-CALC-OUT.
018700
018800 XXXX-READ-PAYROLL.
018900     read PAYROLL-FILE-IN
019000       at end
019100         display "END OF PAYROLL FILE"
019200       not AT end
019300         add 1 to WS-RECORD-COUNT-IN.
019400         
019500 XXXX-WRITE-PAYROLLS-RECORD.
019600     WRITE PAYROLL-REC-OUT.
019700     if GOOD-PAYROLL-FILE-WRITE 
019800        add 1 to WS-RECORD-COUNT-OUT
019900     else  
020000        display "BAD WRITE - FILE STATUS: " 
020100          WS-PAYROLL-FILE-OUT-STATUS.
020200 
020300 XXXX-WRITE-PAYROLL-ERROR-RECORD.
020400    WRITE PAYROLL-ERROR-OUT.
020500    IF GOOD-PAYROLL-ERROR-FILE-WRITE
020600        
020700    ELSE
020800        DISPLAY "BAD ERROR WRITE - FILE STATUS: "
020900                WS-PAYROLL-ERROR-FILE-OUT-STATUS
021000    END-IF.
021100           
021200 XXXX-CREATE-REPORT-TOTAL-LINE.
021300     exit.                                                            
021400 
021500 XXXX-INITIALIZE.
021600     ACCEPT WS-RUN-DATE FROM DATE.
021700     OPEN INPUT  PAYROLL-FILE-IN.
021800     OPEN OUTPUT PAYROLL-FILE-OUT
021900                 PAYROLL-ERROR-FILE-OUT.
022000     MOVE ZEROES to WS-EMP-OUTPUT-AREA.
022100     MOVE   WS-RUN-DATE TO RUN-DATE.
022200     WRITE PAYROLL-REC-OUT FROM WS-RULER.
022300     
022400 XXXX-WRITE-TRAILER.
022500     MOVE WS-FILLER-RECORD TO FILLER-CODE.
022600     MOVE WS-TOTAL-GROSS   TO TOTAL-GROSS.
022700     MOVE WS-TOTAL-NET     TO TOTAL-NET.
022800     WRITE PAYROLL-TOTALS-RECORD.